// --------------------------------------------------------
//	apcEnum.h
// --------------------------------------------------------
//	定数列挙のクラスや列挙型を記載する。
// --------------------------------------------------------
//	一度だけ読み込む
#pragma once

// --------------------------------------------------------
//	必要なヘッダーを読み込む
// --------------------------------------------------------
#include <Windows.h>
#include <dxlib/DxLib.h>

// --------------------------------------------------------
//	名前空間を使用
// --------------------------------------------------------
namespace Apocalypse
{
	// ----------------------------------------------------
	//	Enum名前空間内のクラスを記載
	// ----------------------------------------------------
	namespace Enum
	{
		///	<summary>
		///		テキストの位置を指定するための定数
		///	</summary>
		class TextPosition
		{
		public:
			///	<summary>
			///		左に詰めて表示する。
			///	</summary>
			static const int		Left			= 1;
			///	<summary>
			///		中央に寄せて表示する。
			///	</summary>
			static const int		Center			= 2;
			///	<summary>
			///		右側に寄せて表示する。
			///	</summary>
			static const int		Right			= 3;
		};
	}
}