// --------------------------------------------------------
//	apxDoxygen.h
// --------------------------------------------------------
//	Doxygenのトップページの見栄えを良くするだけ．
// --------------------------------------------------------
//	一度だけ読み込む
#pragma once

// --------------------------------------------------------
//	以下内容
// --------------------------------------------------------
/// \mainpage	Apocalypse
///
///	\section	関数・使用法リファレンス
///
/// \subsection	Apocalypseの説明
///				ゲーム作成のライブラリとして有名なDxライブラリに<br/>
///				機能とかいくつか足して使いやすくした（つもりの）ライブラリ．<br/>
///				まだまだ未完成です．よろしくお願いします．
///
/// \subsection	このライブラリの特徴
///				・描画処理を全自動で行う<br/>
///				いちいち描画する画像ごとに描画関数を書く必要はありません．全て自動です．<br/>
///				・シーケンスやイベントなどのシステム導入で簡単なプログラミング<br/>
///				自分で記述するのは面倒な事柄を内部で行います．<br/>
///				・面倒な初期関数を記述する必要無し<br/>
///				最初にいくつか簡単な設定をするだけでWinMain関数などを内部で処理します．<br/>
///				・And More…
///
/// \subsection	使用方法
///				本体をインストールします．
///				
///				
///				
///				
///				
///
/// \subsection step1 Step 1: Opening the box
///  
/// etc...
///