// --------------------------------------------------------
//	apcSequence.cpp
// --------------------------------------------------------
//	apcSequence.h のメンバ関数の実体を置く
// --------------------------------------------------------
#include "Apocalypse.h"

// --------------------------------------------------------
//	Sequencer
// --------------------------------------------------------
//	Sequencer::Move
// --------------------------------------------------------
void			Sequencer::Move(std::shared_ptr<Sequencer> To)
{
	// シーケンス管理クラスの削除関数を呼ぶ
	__SequenceCollection::GetInstance().Delete(this);
	// 渡された値をシーケンスに追加する
	Add(To);
	// 投げる
	throw this;
}

// --------------------------------------------------------
//	Sequencer::Add
// --------------------------------------------------------
void			Sequencer::Add(std::shared_ptr<Sequencer> To)
{
	// シーケンス管理クラスの追加関数を呼ぶ
	__SequenceCollection::GetInstance().Add(To);
}

// --------------------------------------------------------
//	Sequencer::Delete
// --------------------------------------------------------
void			Sequencer::Delete()
{
	// シーケンス管理クラスの削除関数を呼ぶ
	__SequenceCollection::GetInstance().Delete(this);
	// 投げる
	throw this;
}
